[{"type":"album","slug":"deferred-dreams","released":1715817600000,"links":{"bandcamp":"https://erora.bandcamp.com/album/deferred-dreams"},"label":"Deferred Dreams","description":["The soundtrack for a game that's yet to exist.","","This is my imagining of what I'd compose for my ideal video game! Whether this game ever makes it to release or if I'll be brought on to work on existing games is continuously unknown. Can these tracks change that?","","This is essentially my resume for those interested in my work."],"color":"#dcc47c","tracks":[{"slug":"gloom","links":{"bandcamp":"https://erora.bandcamp.com/track/gloom"},"label":"Gloom","description":["Featuring an ominous piano in reverse, this track aims to innovate within my personal musical style. As a culmination of everything I've learned thus far, I hope that this track can prove my ability!"],"why":["I believe that this track represents everything I've learned thus far. It's compositionally interesting, achieves a clean, wide mix, and features unique sounds that I personally designed. I'm extremely proud of the end result!"]},{"slug":"similitude-bluff","links":{"bandcamp":"https://erora.bandcamp.com/track/similitude-bluff"},"label":"Similitude Bluff","description":["This track was produced with the idea of a boss battle in mind. Integrating a new motif, structure was a priority, to set a stage for future tracks in this style."],"why":["Weird time signatures can be cool! However, I failed the last time I tried to compose in an unusual time signature. This track changed that. I managed to program percussion that sounds real (to me), and ideally you're able to feel the \"edge\" brought on by it!"]}]},{"type":"album","slug":"create-estrogen","released":1712620800000,"links":{"bandcamp":"https://erora.bandcamp.com/album/create-estrogen","spotify":"https://open.spotify.com/album/1mI32oeZ5AVsyVAftq2crM","appleMusic":"https://geo.music.apple.com/us/album/_/1740422550?mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/playlist?list=OLAK5uy_lQVIuKgwWRny8M7qbEcTkj3y8UARIap5E","songLink":"https://album.link/s/1mI32oeZ5AVsyVAftq2crM"},"label":"Create: Estrogen","description":["The soundtrack for the Minecraft mod, \"Create: Estrogen\". Contains ambient music in familiar styles, as well as a secret music disc!","","All of these tracks are inspired by two primary sources: Minecraft and Celeste. As the mod is for Minecraft, it was of my personal belief that I had to make songs in vain of the game's existing tracks. Additionally, the mod incorporates features from the game Celeste, so I drew massive inspiration from it as well.","","When I started producing this album, I intended to stick to the aforementioned sources as closely as possible. However, I soon realized that would not be possible with my skills. So, instead, I excuse the differences in styles for being my own personal style. I look up to Lena Raine and C418, who both have amazing and unique musical styles. I still hope that I was able to reproduce the right vibes!"],"color":"#ce8d48","tracks":[{"slug":"inferred-dreams","links":{"bandcamp":"https://erora.bandcamp.com/track/inferred-dreams","spotify":"https://open.spotify.com/track/6VngLd80KD0OpoLK9Ja4Jx","appleMusic":"https://geo.music.apple.com/us/album/_/1740422550?i=1740422551&mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/watch?v=hCSs-muxSjI","songLink":"https://song.link/s/6VngLd80KD0OpoLK9Ja4Jx"},"label":"Inferred Dreams","description":["Lena Raine's philosophy, with a focus on softness and quietness, took control of this track. I intentionally pushed myself to embrace the power of silence, and though I couldn't push myself as much as I'd prefer, compared to my previous tracks, I have achieved my goal.","","Only after I had finished this track did I realize it's subconscious inspiration: C418's remix of \"Atempause\". I loved their rendition of the track. It had been a few months since I had last heard it, so I unfortunately didn't make the connection as soon as I'd like."],"why":["Featuring randomly generated percussion and an overlapping chord pattern, this track began as my answer to Lena Raine's \"Stand Tall\". I noticed how her track mastered the concept of silence, which I wanted to reproduce. This track started with two widely spaced chords, which were then sped up and layered over the original chord pattern."]},{"slug":"aurum-berry","links":{"bandcamp":"https://erora.bandcamp.com/track/aurum-berry","spotify":"https://open.spotify.com/track/5PpUWZ2zmGXSRcIptNGDEZ","appleMusic":"https://geo.music.apple.com/us/album/_/1740422550?i=1740422552&mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/watch?v=bX-869V4z2U","songLink":"https://song.link/s/5PpUWZ2zmGXSRcIptNGDEZ"},"label":"Aurum Berry","description":["Essentially being a remix of Lena Raine's \"Resurrections\", this track aims to closely recreate the vibe and structure of Celeste. What better way to accomplish that, than to steal!?","","I'm quite proud of how I mixed the styles of Lena Raine, C418, and my own while sticking to a familiar sound. What you don't hear are the tens of demos I had unsuccessfully produced before this.","","Of course, without using Resurrections as inspiration, this track would be nothing. Thank you, Lena Raine, for releasing such an amazing song, and teaching others how it was composed."],"why":["When composing tracks for the mod, I knew I wanted to capture a Celeste-like vibe. I thought it would be a great idea to implement a motif from one of the most iconic songs, \"Resurrections\". I initially didn't want to make a track *too* similar to it, yet I ended up fully committing and producing a reimagining of the track."]},{"slug":"amphitrite","links":{"bandcamp":"https://erora.bandcamp.com/track/amphitrite","spotify":"https://open.spotify.com/track/2fKzEXuJb0McNAtWyGZeJ4","appleMusic":"https://geo.music.apple.com/us/album/_/1740422550?i=1740422554&mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/watch?v=TayI8nEyjOk","songLink":"https://song.link/s/2fKzEXuJb0McNAtWyGZeJ4"},"label":"Amphitrite","description":["The focus for this track is realism. I had started to source, and even create, sample libraries based on physical instruments. Prior to this song's creation, I only used synthesized instruments.","","I was scared to try anything more. I didn't believe that I could pull off realistic sounding instrumentation. And yet, through trial and error, many revisions, and lots of manual automation, I believe I've done it."],"why":["When listening to the demos exported throughout this song's development, I'm proud of how this track ended up. Not only did it motivate me to start using real instrument samples, it also went through a journey of its own. Though, looking back, I would have changed how the percussion was programmed."]},{"slug":"sleeping","links":{"bandcamp":"https://erora.bandcamp.com/track/sleeping","spotify":"https://open.spotify.com/track/6Rqf9WekV0JOwGC1jrgg76","appleMusic":"https://geo.music.apple.com/us/album/_/1740422550?i=1740422555&mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","songLink":"https://song.link/s/6Rqf9WekV0JOwGC1jrgg76"},"label":"Sleeping","description":["A track that was almost entirely produced and mastered in a single day. It doesn't exactly follow the styles of Lena Raine or C418, and was rather made as I went.","","Despite its extremely short production time, and the fact that it was rushed, I still enjoy the end result quite a bit! It's a unique track in the album, almost serving as a transition between my older style (as seen in G03C) and the rest of the album."],"why":["Shortly after this album was released, the soundtrack for Minecraft 1.21 was also announced. I struggled to make the connection between this track and any tracks from Minecraft or Celeste until the new Minecraft tracks were released. In retrospect, I believe that I've captured the vibe of the new, extraordinary track, \"Deeper\". Has Lena Raine's style already impacted my own musical styles this much, or was it an amazing coincidence?"]},{"slug":"inner-self-realization","links":{"bandcamp":"https://erora.bandcamp.com/track/inner-self-realization","spotify":"https://open.spotify.com/track/3VXJKjGhjYOuaKa5XXlOCc","appleMusic":"https://geo.music.apple.com/us/album/_/1740422550?i=1740422557&mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/watch?v=_0VfTNvHXdE","songLink":"https://song.link/s/3VXJKjGhjYOuaKa5XXlOCc"},"label":"Inner Self-Realization","description":["A short and simple piano piece featuring various motifs from the tracks prior. This almost didn't make the cut due to an unexpected deadline, yet I was able to sneak it in! I'm glad, because despite its simplicity, it's a great closer for the album."],"why":["All throughout my musical journey, I have struggled to find what makes a song \"good\". Even during this album's development, I would push tracks further and further, even if it hurt the end result. This is the track I held back with. I understood that more did not equal better. I now understand that complexity and instrument count are not what make a good song."]}]},{"type":"album","slug":"momentum-deceived","released":1704067200000,"links":{"bandcamp":"https://erora.bandcamp.com/album/momentum-deceived","spotify":"https://open.spotify.com/album/180HPq0QQEsr4c8um4MyBM","appleMusic":"https://geo.music.apple.com/us/album/_/1723753633?mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/playlist?list=OLAK5uy_kMHIkrIJyM3wCag7YeFILpAHELtt5F4x8","songLink":"https://album.link/s/180HPq0QQEsr4c8um4MyBM"},"label":"Momentum Deceived","description":["The attempts to push towards my aspirations. Was this momentum towards success, or had I been deceived? Only time will tell.","","Momentum Deceived consists of songs that I deem \"ready for publishing\", which means they satisfy or surpass the perfectionism I inflict upon my creativity."],"color":"#8242f7","tracks":[{"slug":"so-far","links":{"bandcamp":"https://erora.bandcamp.com/track/so-far","spotify":"https://open.spotify.com/track/6bJwgegbgiEFSIgR4btZCI","appleMusic":"https://geo.music.apple.com/us/album/_/1723753633?i=1723753941&mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/watch?v=WH4M7Yho5Lo","songLink":"https://song.link/s/6bJwgegbgiEFSIgR4btZCI"},"label":"So Far","description":["After I had completed Visionary, I was in the mood to create something calmer. This ended up taking an orchestral direction, which I ended up scrapping due to it not fitting in well within the rest of the album. Instead, I deleted every instrument, keeping only the notes I had placed down, and created a percussion track. This new version of the track had a similar vibe to the rest of the album, which I'm quite proud of."],"why":["It's important to understand when it might be time to cut your losses and start over. I had considered just pushing onwards with the initial sound of the track, yet I decided that I wouldn't be as happy with the final product, which wasn't worth it."]},{"slug":"planadaxic","links":{"bandcamp":"https://erora.bandcamp.com/track/planadaxic","spotify":"https://open.spotify.com/track/4Av7G8IGCaXES1YO6FOShl","appleMusic":"https://geo.music.apple.com/us/album/_/1723753633?i=1723753943&mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/watch?v=yVAna6Kii_4","songLink":"https://song.link/s/4Av7G8IGCaXES1YO6FOShl"},"label":"Planadaxic","description":["This track was based on what I had created during a sound design jam session. The \"beeps\" you hear during the majority of the song were created during that session and were originally designed to be played back much faster. I tried to form a track around it but wasn't pleased with how it sounded. I had the idea to slow the whole project down, resulting in this eight-minute long epic."],"why":["The most computationally complex track I've produced. The aforementioned \"beeps\" alone overloaded my system. This marked the beginning of my massive homemade instrument patch journey!"]},{"slug":"precipice-of-origin-2","links":{"bandcamp":"https://erora.bandcamp.com/track/precipice-of-origin-2","spotify":"https://open.spotify.com/track/0jzXV5uhE3z3IEvVqfr2PP","appleMusic":"https://geo.music.apple.com/us/album/_/1723753633?i=1723753942&mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/watch?v=_6NBSi1qTIc","songLink":"https://song.link/s/0jzXV5uhE3z3IEvVqfr2PP"},"label":"Precipice of Origin","description":["From this album's inception, I had planned to include two transition tracks that would lead into and out of Midten, which I've now released separately. Despite this, I still liked the idea of transitioning into two halves of the album, ideally through minimalistic tracks. This resulted in such a simple yet ambient song."],"why":[""]},{"slug":"order-2","links":{"bandcamp":"https://erora.bandcamp.com/track/order-2","spotify":"https://open.spotify.com/track/1eYDVsxCTZR9EzWBbJuipX","appleMusic":"https://geo.music.apple.com/us/album/_/1723753633?i=1723753945&mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/watch?v=n-ciJyQPOew","songLink":"https://song.link/s/1eYDVsxCTZR9EzWBbJuipX"},"label":"Order","description":["This album pushed me to improve in many aspects of music production. One of those being my piano skills. Order initially started through my attempts to get better at playing the keys. I ended up finding a verse and chorus melody that I enjoyed, resulting in this song's development. It was also the leading factor of inspiration for the album's cover art, with its retro 80s vibe."],"why":["As a musician, I've been learning how to play various instruments all my life. Though, one instrument I constantly pushed away was the piano. Since most of my work is synthesized through a piano roll, learning the piano could enhance my understanding of what I'm producing."]},{"slug":"momentum-deceived","links":{"bandcamp":"https://erora.bandcamp.com/track/momentum-deceived","spotify":"https://open.spotify.com/track/7vlPBIDq30uCfVyEljciIa","youtube":"https://www.youtube.com/watch?v=sxTj8XoZn0M","songLink":"https://song.link/s/7vlPBIDq30uCfVyEljciIa"},"label":"Momentum Deceived","description":["Featuring everything I've learned during this album's development, Momentum Deceived leads us into what's to come. With its realistic drum patterns powered by BFD3, this track paves the way for a less electronic album in the future."],"why":["Upon starting this track, my biggest goal was to produce realistic percussion. This is something I had attempted in the past, but in every case, I felt as though it was too complicated yet repetitive. I used BFD3's visualizations to think like a drummer, and write complex - yet not impossible patterns."]}]},{"type":"album","slug":"awry","released":1712102400000,"links":{"bandcamp":"https://erora.bandcamp.com/album/awry","spotify":"https://open.spotify.com/album/4O23PAiCcFfk08hww7X6H0","appleMusic":"https://geo.music.apple.com/us/album/_/1739325383?mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/playlist?list=OLAK5uy_mP--Y_6pasUloxtEY52QF9GYEVeetWquo","songLink":"https://album.link/s/4O23PAiCcFfk08hww7X6H0"},"label":"AWRY","description":["This album is a collection of demos, B-sides, and my early musical releases. It contains tracks from albums that have already been released on Bandcamp, such as Wisp and Midten, as well as previously unheard songs.","","Track quality varies throughout the entire album, as they've been made anytime in the past three years! I've still attempted to order the album to flow nicely between eras and genres. Whether I have succeeded is up to you.","","I'm proud of where I am now, but I often struggle to realize my own skills. Reflecting on where I came from definitely helps—I'm able to see that I am improving, no matter how I feel. Hopefully, these tracks can help others who may struggle during their own personal journey!","","Each track will specify the era they were recorded in, the DAW they were built with, and a small description as to why I made the tracks.","","• \"Progressive\" era are demos recorded afterwards. No finished tracks were produced during this time.","• \"Momentum Deceived\" era contains B-sides from the album.","• \"Midten\" era signifies tracks before May 12, 2023. These were made to be more melodic and concise.","• \"Wisp\" era signifies tracks before April 24, 2022. Consists of various experiments I've done to further improve my songwriting and producing skills.","• \"Collection\" era signifies tracks before November 24, 2022. These tracks were my introduction to public songwriting."],"color":"#fa8a04","tracks":[{"slug":"natural-decay","links":{"bandcamp":"https://erora.bandcamp.com/track/natural-decay","spotify":"https://open.spotify.com/album/4O23PAiCcFfk08hww7X6H0","appleMusic":"https://geo.music.apple.com/us/album/_/1739325383?mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/playlist?list=OLAK5uy_mP--Y_6pasUloxtEY52QF9GYEVeetWquo","songLink":"https://album.link/s/4O23PAiCcFfk08hww7X6H0"},"label":"Natural Decay","description":["This is the first track I have released publicly. It kicked off my music production career. Its theme (and working title) was \"Ambient Mystery\", though that theme changed throughout its development. Biggest inspiration was C418, as heard in the percussion.","","Recorded during the Collection era. Produced on GarageBand for iOS."],"why":["I still believe this track holds up to this day. I hadn't learned the art of simplicity yet, and I believed that my future tracks had to be more complex in order to prove my ability. Yet, often, the opposite is true, and this track proves it."]},{"slug":"d","links":{"bandcamp":"https://erora.bandcamp.com/track/d","spotify":"https://open.spotify.com/album/4O23PAiCcFfk08hww7X6H0","appleMusic":"https://geo.music.apple.com/us/album/_/1739325383?mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/playlist?list=OLAK5uy_mP--Y_6pasUloxtEY52QF9GYEVeetWquo","songLink":"https://album.link/s/4O23PAiCcFfk08hww7X6H0"},"label":"Dø","description":["A dark, ambient electronic song inspired by the likes of video game soundtracks such as Celeste. Designed to play in the background, this track attempts to mix my typically complex personal styles with the art of simplicity.","","Recorded during the Midten era. Produced on GarageBand for iOS."],"why":["Prior to this track, many of my songs were very repetitive. Most of them were built off of the same chorus, melody, ambience, etc. I wanted to change this, and experimented with splitting this track into different parts, and returning to the original chorus at the end."]},{"slug":"end-of-time","links":{"bandcamp":"https://erora.bandcamp.com/track/end-of-time","spotify":"https://open.spotify.com/album/4O23PAiCcFfk08hww7X6H0","appleMusic":"https://geo.music.apple.com/us/album/_/1739325383?mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/playlist?list=OLAK5uy_mP--Y_6pasUloxtEY52QF9GYEVeetWquo","songLink":"https://album.link/s/4O23PAiCcFfk08hww7X6H0"},"label":"End of Time","description":["The experiments have come to a close. A success has been made. It's time to move on.","","This track closes out Wisp, and contains many of the techniques I've learned throughout my experimentation. It's also structured in the same way that the first (written) song in Wisp was.","","I was greatly inspired by the Mirror's Edge soundtrack, as well as Fiber Bundles from Animusic.","","Recorded during the Wisp era. Produced on Ableton Live."],"why":["This track unknowingly paved the way for my future album, Momentum Deceived. Its retro vibe and heavy compression made their way into my personal mixing style."]},{"slug":"valley","links":{"bandcamp":"https://erora.bandcamp.com/track/valley","spotify":"https://open.spotify.com/album/4O23PAiCcFfk08hww7X6H0","appleMusic":"https://geo.music.apple.com/us/album/_/1739325383?mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/playlist?list=OLAK5uy_mP--Y_6pasUloxtEY52QF9GYEVeetWquo","songLink":"https://album.link/s/4O23PAiCcFfk08hww7X6H0"},"label":"Valley","description":["A mix between an electronic and orchestral style. One of my first orchestral compositions, featuring many layers of strings and even a bassoon.","","I used this track to practice orchestral songwriting, while incorporating my own styles. The percussion is also focused on being realistic and humanly playable.","","Recorded during the Wisp era. Produced on GarageBand for iOS."],"why":["Produced after Continuum, another track in a similar style, this was my attempt at polishing my realistic percussion style. I wanted to implement more parts of the drum kit into my patterns, resulting in heavy use of the toms."]},{"slug":"sanitys-culmination","links":{"bandcamp":"https://erora.bandcamp.com/track/sanitys-culmination","spotify":"https://open.spotify.com/album/4O23PAiCcFfk08hww7X6H0","appleMusic":"https://geo.music.apple.com/us/album/_/1739325383?mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/playlist?list=OLAK5uy_mP--Y_6pasUloxtEY52QF9GYEVeetWquo","songLink":"https://album.link/s/4O23PAiCcFfk08hww7X6H0"},"label":"Sanity's Culmination","description":["This track is greatly inspired by progressive rock. From the length to the percussion style, every aspect of this song was built to the styles of Porcupine Tree or RPWL, with my own style mixed in.","","This track's \"lyrics\" tell the story of someone who's driven themselves to insanity, and nobody stepped in to help them. I'm not a singer, nor do I plan on singing over this track, so you'll have to imagine how they'd be sung","","Recorded during the Wisp era. Produced on Ableton Live."],"why":["Not only was this my first attempt at producing a proggy song, it's also the first track I wrote lyrics for. Even if cheesy, being based on events that took place in my life, they came from the heart."]},{"slug":"sky-demo","links":{"bandcamp":"https://erora.bandcamp.com/track/sky-demo","spotify":"https://open.spotify.com/album/4O23PAiCcFfk08hww7X6H0","appleMusic":"https://geo.music.apple.com/us/album/_/1739325383?mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/playlist?list=OLAK5uy_mP--Y_6pasUloxtEY52QF9GYEVeetWquo","songLink":"https://album.link/s/4O23PAiCcFfk08hww7X6H0"},"label":"Sky (Demo)","description":["Motivated by the works of Chris Christodoulou, this was my first demo focusing on producing a proggy sound. While sloppy, due to the fact that I haven't practiced guitar often, I believe this track successfully reproduces the soul of progressive rock.","","Recorded during the Progressive era. Produced on Bitwig Studio."],"why":["Though this is a rough demo that requires lots of polish, I'm proud of what I pulled off despite my limitations. Even though I didn't own a bass, nor could I think like a drummer, I still prevailed."]},{"slug":"kelno","links":{"bandcamp":"https://erora.bandcamp.com/track/kelno","spotify":"https://open.spotify.com/album/4O23PAiCcFfk08hww7X6H0","appleMusic":"https://geo.music.apple.com/us/album/_/1739325383?mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/playlist?list=OLAK5uy_mP--Y_6pasUloxtEY52QF9GYEVeetWquo","songLink":"https://album.link/s/4O23PAiCcFfk08hww7X6H0"},"label":"Kelno","description":["The result of a challenge to compose a song in less than an hour. This restriction let me break out of my perfectionist composition style, and rather compose a full song. I believe this turned out very well, and helped me in my future compositions.","","Recorded during the Collection era. Produced on GarageBand for iOS."],"why":["While Natural Decay is the first track I publicly released, Kelno was the first track I released featuring a realistic style. I believe this song falls under the genre of contemporary, with realistic and synthetic instruments intertwined."]},{"slug":"huil-2","links":{"bandcamp":"https://erora.bandcamp.com/track/huil-2","spotify":"https://open.spotify.com/album/0mSofIZKFMCvT2we17hdjZ","appleMusic":"https://geo.music.apple.com/us/album/_/1739334400?mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/playlist?list=OLAK5uy_mIrMnfT55xXs2eIngNC3G1RXcAwGCBqcE","songLink":"https://album.link/s/0mSofIZKFMCvT2we17hdjZ"},"label":"Huil","description":["This track originated from the urge to produce a track unlike anything I've made prior. Directly inspired by D&B, this track aimed to provide a \"full\" sound, with sample-type percussion and instruments.","","Recorded during the Midten era. Produced on GarageBand for iOS."],"why":["It's important to branch out and try new things. This was my method of doing so. In the process, I learned a lot about both the target genre and my own personal styles. This may not be D&B, but the influence is there!"]},{"slug":"gaze","links":{"bandcamp":"https://erora.bandcamp.com/track/gaze","spotify":"https://open.spotify.com/album/0mSofIZKFMCvT2we17hdjZ","appleMusic":"https://geo.music.apple.com/us/album/_/1739334400?mt=1&app=music&ls=1&at=1000lHKX&ct=api_http&itscg=30200&itsct=odsl_m","youtube":"https://www.youtube.com/playlist?list=OLAK5uy_mIrMnfT55xXs2eIngNC3G1RXcAwGCBqcE","songLink":"https://album.link/s/0mSofIZKFMCvT2we17hdjZ"},"label":"Gaze","description":["This track is very experimental, and as such may not be nice to listen to for many. Halfway through the song, the time signature starts to alternate, creating strange hangs.","","Recorded during the Collection era. Produced on GarageBand for iOS."],"why":["While producing this track, I did not understand what I was doing. Only after it was released did I realize that I had written a song with time signature shenanigans. As someone who enjoys progressive music, this delighted me!"]}]}]